{"pages":[],"posts":[{"title":"ABOUT ME","text":"I graduated with honor from Zhejiang University of Technology (Jianxing class) in July 2017 and got my B.Eng. in Software Engineering here. I worked on computer graphics during my internship with associate professor Zhangye Wang (ZJU) at State Key Lab of CAD&amp;CG, Zhejiang University (2015-2017). My undergrad thesis is on the design and development of real-time infrared simulation system for natural environment (Journal of Computer-Aided Design &amp; Computer Graphics). I graduated with honor from East China Normal University in July 2020 and got my M.Phi. in Software Engineering here. I worked on computer graphics and high performance computing with professor Changbo Wang (ECNU) and professor Hong Qin (Stony Brook University, New York). My master thesis is on hybrid parallel framework for SPH algorithms. I currently work with Professor Taku Komura (Hong Kong Unversity) and Doctor Chitalu Floyd (Edinburgh University) on physical simulation and geometry processing. My current research interests include: Physical Simulation, High performance computing, Geometry Processing, Physical based rendering, Machine Learning … NEWS 2021 - I receipt a full-time Phd offer from Computer Science Department, Hong Kong University, and my supervisors are Professor Taku Komura (primary) and Professor Wenping Wang (co-supervisor). Great Thanks for Taku’s help! RECENT RESEARCH A Novel Plastic Phase-Field Method for Ductile Fracture with GPU Optimization[J].Zipeng Zhao*, Kemeng Huang* (equal contribution), Chen Li, Changbo Wang, Hong Qin.Computer Graphics Forum, 2020 (PG 2020).[Paper] Novel Hierarchical Strategies for SPH-centric Algorithms on GPGPU[J].Kemeng Huang, Zipeng Zhao, Chen Li, Changbo Wang, Hong Qin.Graphical Models, 2020.[Paper] A General Novel Parallel Framework for SPH-centric Algorithms[J].Kemeng Huang, Jiming Ruan, Zipeng Zhao, Chen Li, Changbo Wang, Hong Qin.Proceedings of the ACM on Computer Graphics and Interactive Techniques, 2019 (I3D 2019).[Paper] One Improved Real-Time Infrared Simulation System Based on Unity3D[J].Zhang Fan, Wang Tong, Huang Kemeng, Mao Jiaming, Li Meiling, Wang Zhangye.Journal of Computer-Aided Design &amp; Computer Graphics, 2018.[Paper] AWARDS China National Scholarship 2019 China Post-Graduate Mathematical Contest in Modeling 2018, National First Prize American Mathematical Contest in Modeling 2016, Honorable Mention China Undergraduate Mathematical Contest in Modeling 2015, National First Prize EXPERIENCES Research Assistant (computer graphics), Hong Kong University &amp; Centre for Transformative Garment Production. 2021.6-2022.6 Research Engineer (computer graphics), Koolab, Kujiale. 2020.8-2021.1 Internship in graphics algorithm (GPU optimization), Intel. 2019.3-2019.8 M.Phi. in Software Engineering (computer graphics), East China Normal University. 2017.9-2020.7 Internship in computer graphics (simulation), State Key Lab of CAD&amp;CG, Zhejiang University. 2015.7-2017.5 B.Eng. in Software Engineering (computer graphics), Zhejiang University of Technology. 2013.9-2017.7 INTERESTS painting, basketball, fishing, farming… CONTACT MEKMHuang@stu.ecnu.edu.cnKMHuang819@gmail.comhkm819@qq.com unsplash-logoWenzhou City, Zhejiang Province, China","link":"/2020/07/10/AboutME/"}],"tags":[{"name":"ME","slug":"ME","link":"/tags/ME/"}],"categories":[{"name":"about me","slug":"about-me","link":"/categories/about-me/"}]}